## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_user_assigned_identity.uami will be destroyed
  # (because azurerm_user_assigned_identity.uami is not in configuration)
  - resource "azurerm_user_assigned_identity" "uami" {
      - client_id           = "9a267459-7687-4cde-b5fb-fbfca51da7ec" -> null
      - id                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-aztf-log-prod-ne-02" -> null
      - location            = "northeurope" -> null
      - name                = "uami-aztf-log-prod-ne-02" -> null
      - principal_id        = "53f4ab1f-6394-474a-8ea2-4ab51acaf75f" -> null
      - resource_group_name = "rg-aztf-logging-prod-ne-02" -> null
      - tags                = {} -> null
      - tenant_id           = "48c383d8-47c5-48f9-9e8b-afe4f2519054" -> null
    }

  # module.uami.azurerm_user_assigned_identity.uami will be created
  + resource "azurerm_user_assigned_identity" "uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "uami-aztf-log-prod-ne-02"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aztf-logging-prod-ne-02"
      + tenant_id           = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>